app/views/inspectors/show.html.erb

			<tbody>
				<% @inspector.reports.sorted.each do |report| %>
---
SELECT "reports".* FROM "reports" WHERE "reports"."inspector_id" = $1  ORDER BY reports.inspection_datetime DESC  [["inspector_id", 2]]

		</table>
		<!--<a href="/reports/">All <%= @inspector.reports.count %> reports</a>-->
---
SELECT COUNT(*) FROM "reports" WHERE "reports"."inspector_id" = $1  [["inspector_id", 2]]

			<tbody>
				<% @inspector.inspection_templates.each do |template| %>
---
SELECT "inspection_templates".* FROM "inspection_templates" WHERE "inspection_templates"."inspector_id" = $1  [["inspector_id", 2]]

		</table>
		<!--<a href="/inspection_templates/">All <%= @inspector.inspection_templates.count %> templates</a>-->
---
SELECT COUNT(*) FROM "inspection_templates" WHERE "inspection_templates"."inspector_id" = $1  [["inspector_id", 2]]

-->
<!--<a href="/inspector_statements/">All <%= @inspector.inspector_statements.count %> statements</a>-->
---
SELECT COUNT(*) FROM "inspector_statements" WHERE "inspector_statements"."inspector_id" = $1  [["inspector_id", 2]]