app/controllers/access_controller.rb

SELECT  "inspectors".* FROM "inspectors" WHERE "inspectors"."email" = $1  ORDER BY "inspectors"."id" ASC LIMIT 1  [["email", "andy@tahi.com"]]
---
  def attempt_login

    #Rails.logger.info(request.env)
    puts params[:password]
    puts params[:email]
    if params[:email].present? && params[:password].present?
      found_user = Inspector.where(:email => params[:email]).first