app/controllers/inspection_templates_controller.rb

  def show
    #@template = @inspector.inspection_templates.includes(sections: [{statements: :statement_type}, :section_type, {to_dos: {answers: { rules: :inspector_statement } } }, :cyas]).find(params[:id])
    @template = @inspector.inspection_templates.includes(sections: [{statements: :statement_type}, {section_type: :inspector_statements}, {to_dos: {answers:  :inspector_statements } }, :cyas]).find(params[:id])
    @statement_types = StatementType.all
---
SELECT  "inspection_templates".* FROM "inspection_templates" WHERE "inspection_templates"."inspector_id" = $1 AND "inspection_templates"."id" = $2 LIMIT 1  [["inspector_id", 1], ["id", 1]]
SELECT "statement_types".* FROM "statement_types"

  def destroy
    @inspectionTemplate.destroy
---
DELETE FROM "inspection_templates" WHERE "inspection_templates"."id" = $1  [["id", 17]]

    def set_inspection_template
      @inspectionTemplate = @inspector.inspection_templates.find(params[:id])
---
SELECT  "inspection_templates".* FROM "inspection_templates" WHERE "inspection_templates"."inspector_id" = $1 AND "inspection_templates"."id" = $2 LIMIT 1  [["inspector_id", 2], ["id", 17]]