app/controllers/inspectors_controller.rb

SELECT  "inspectors".* FROM "inspectors" WHERE "inspectors"."id" = $1 LIMIT 1  [["id", 2]]
---
  def show
    # TODO: revisit this if I want to figure out how to keep csrf checking
    #response.header['X-CSRF-Token'] = form_authenticity_token
    @inspector = Inspector.find(session[:user_id])