app/controllers/reports_controller.rb

  def destroy
    # TODO: make sure it's not possible to destroy another inspector's report
    @report.destroy
---
DELETE FROM "reports" WHERE "reports"."id" = $1  [["id", 59]]

  def show
    #@report = @inspector.reports.includes(sections: [{statements: :statement_type, statements: :answer_values}, :section_type, :images]).find(params[:id])
    @report = @inspector.reports.includes(sections: [{statements: :statement_type}, :section_type, :images]).find(params[:id])
    @statement_types = StatementType.all
---
SELECT  "reports".* FROM "reports" WHERE "reports"."inspector_id" = $1 AND "reports"."id" = $2 LIMIT 1  [["inspector_id", 2], ["id", 59]]
SELECT  "statement_types".* FROM "statement_types" WHERE "statement_types"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "section_types".* FROM "section_types" WHERE "section_types"."id" IN (210, 206, 202, 198, 194, 190, 186, 182, 178, 174, 170, 166, 162, 158, 154, 150, 146, 142, 138, 134, 130, 126, 122, 118, 114, 110, 106, 102, 98, 94, 90, 86, 82, 78, 74, 70, 66, 62, 58, 54, 50, 46, 42, 38, 34, 30, 26, 22, 18, 14, 10, 6, 2)
SELECT "statement_types".* FROM "statement_types"