app/views/reports/new.html.erb

		<select class="form-control" name="inspection_template_id" id="inspection_template_id">
			<%=
			@inspector.inspection_templates.each do |template|
---
SELECT "inspection_templates".* FROM "inspection_templates" WHERE "inspection_templates"."inspector_id" = $1  [["inspector_id", 1]]

		<label for="report_report_type_id">Report Type</label>
		<%= collection_select(:report, :report_type_id, ReportType.all, :id, :name, {}, {:class => "form-control"}) %>
---
SELECT "report_types".* FROM "report_types"